-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 23, 2020 at 07:00 AM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `quranportalsearch`
--

-- --------------------------------------------------------

--
-- Table structure for table `article`
--

CREATE TABLE `article` (
  `a_id` int(11) NOT NULL,
  `a_title` varchar(256) NOT NULL,
  `a_text` text NOT NULL,
  `a_author` varchar(256) NOT NULL,
  `a_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `article`
--

INSERT INTO `article` (`a_id`, `a_title`, `a_text`, `a_author`, `a_date`) VALUES
(1, '50 great summer recipes', 'There are many recipes you can create for the summer which involves grilling, boiling, frying and toasting.', 'Admin', '2017-11-25 12:23:11'),
(2, 'A series of computer softwar', 'In this article, you will learn about some of the softwar used on computer. This involve basic softwar and more advanced softwar used by developers.', 'Daniel Nielson', '2017-11-25 12:23:11'),
(3, 'Eid Ul Adha', 'Eid Ul Adha is a Muslim festival that basically marks the end of Hajj or Pilgrimage to Makkah. This Eid is also known as the Eid of sacrifice, and it basically commemorates the faith of Abraham and devotion to Allah. According to the Belief of the Muslims, Allah asked Abraham to sacrifice his son for Allah’s sake, and even though he was a good man and loved his son very much, his devotion and faith to God was so strong that he did not hesitate to take this bold step and agreed to sacrifice his son (Huda, 2011). The willingness of Abraham to sacrifice his son for the sake of Allah caused Allah to spare his son’s life, and therefore a lamb was sacrificed in his place. ', 'QuranPortal', '2020-07-29 12:40:11'),
(4, 'Eid Ul Adha Is A Muslim Festival Theology Religion Essay', 'Eid Ul Adha is a Muslim festival that basically marks the end of Hajj or Pilgrimage to Makkah. This Eid is also known as the Eid of sacrifice, and it basically commemorates the faith of Abraham and devotion to Allah. According to the Belief of the Muslims, Allah asked Abraham to sacrifice his son for Allah’s sake, and even though he was a good man and loved his son very much.', 'Admin', '2020-07-29 12:40:11'),
(5, 'Learn all about the Muslim festival Eid al-Adha', 'The festival celebrates a story about a prophet called Ibrahim (Abraham). Ibrahim had been told by Allah (God) that he must sacrifice his son Ishamel (Ishmael) to prove his faith to Allah.Ibrahim decided to follow Allah’s command. The devil tried to convince him to disobey, but Ibrahim refused. He threw pebbles at the devil to make him leave. When Ibrahim was about to sacrifice his son, he found that Allah had replaced Ishamel with a ram (though some say it was in fact a lamb). Ibrahim had proved his devotion to Allah, so his son was spared. ', 'Admin', '2020-07-29 12:40:11');

-- --------------------------------------------------------

--
-- Table structure for table `post`
--

CREATE TABLE `post` (
  `post_id` int(11) NOT NULL,
  `post_title` varchar(100) NOT NULL,
  `post_description` text NOT NULL,
  `post_date` datetime NOT NULL,
  `author` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `post`
--

INSERT INTO `post` (`post_id`, `post_title`, `post_description`, `post_date`, `author`) VALUES
(19, 'তাওহীদঃ আল্লাহ তায়ালা সৃষ্টিকুলের সৃষ্টিকর্তা', '                                                            তিনিই সে সত্ত্বা যিনি সৃষ্টি করেছেন তোমাদের জন্য যা কিছু জমিনে রয়েছে সে সমস্ত। তারপর তিনি মনঃসংযোগ করেছেন আকাশের প্রতি। বস্তুতঃ তিনি তৈরি করেছেন সাত আসমান। আর আল্লাহ সর্ববিষয়ে অবহিত । [সুরা বাকারা ২ঃ২৯]\r\n                                                ', '2020-08-08 17:44:00', 4),
(21, 'তাওহীদঃসুরা আল আম্বিয়া আল্লাহর ক্ষমতার ব্যাপারে যা বলে', '                                        তিনিই সৃষ্টি করেছেন রাত্রি এবং দিন এবং সূর্য এবং চন্দ্র। সবাই আপন আপন কক্ষপথে বিচরন করে। [সুরা আম্বিয়া ২১ঃ৩৩]\r\n                                ', '2020-08-08 17:34:00', 4),
(22, 'তাওহীদঃ সকল কিছুর মালিক আল্লাহ সুরা নুর এ ব্যাপারে যা বলেনঃ', '                                                                                আল্লাহ প্রত্যেক চলন্ত জীবকে পানি দ্বারা সৃষ্টি করেছেন। তাদের কতেক বুকে ভর দিয়ে চলে, কতেক দুই পায়ে ভর দিয়ে চলে এবং কতেক চার পায়ে ভর দিয়ে চলে; আল্লাহ যা ইচ্ছা সৃষ্টি করেন। নিশ্চয় আল্লাহ সবকিছু করতে সক্ষম। [সুরা নুর ২৪ঃ৪৫]\r\n                                                                ', '2020-08-08 17:33:00', 4),
(24, 'তাওহীদঃ আল্লাহ সকল ক্ষমতার অধিকারী ', '                                                                                 সর্ববিধ প্রশংসা আল্লাহরই জন্য যিনি নভোমন্ডল ও ভূমন্ডল সৃষ্টি করেছেন এবং অন্ধকার ও আলোর উদ্ভব করেছেন। তথাপি কাফেররা স্বীয় পালনকর্তার সাথে অন্যান্যকে সমতুল্য স্থির করে। [ সুরা আনয়াম ৬ঃ১]  \r\n  \r\n তিনিই সঠিকভাবে নভোমন্ডল সৃষ্টি করেছেন। যেদিন তিনি বলবেনঃ হয়ে যা, অতঃপর হয়ে যাবে। তাঁর কথা সত্য। যেদিন শিঙ্গায় ফুৎকার করা হবে, সেদিন তাঁরই আধিপত্য হবে। তিনি অদৃশ্য বিষয়ে এবং প্রত্যক্ষ বিষয়ে জ্ঞাত। তিনিই প্রজ্ঞাময়, সর্বজ্ঞ। [ সুরা আনয়াম ৬ঃ ৭৩]  \r\n\r\nতিনি নভোমন্ডল ও ভূমন্ডলের আদি স্রষ্টা। কিরূপে আল্লাহর পুত্র হতে পারে, অথচ তাঁর কোন সঙ্গী নেই ? তিনি যাবতীয় কিছু সৃষ্টি করেছেন। তিনি সব বস্তু সম্পর্কে সুবিজ্ঞ। তিনিই আল্লাহ তোমাদের পালনকর্তা। তিনি ব্যতীত কোন উপাস্য নেই। তিনিই সব কিছুর স্রষ্টা। অতএব, তোমরা তাঁরই এবাদত কর। তিনি প্রত্যেক বস্তুর কার্যনির্বাহী।দৃষ্টিসমূহ তাঁকে পেতে পারে না, অবশ্য তিনি দৃষ্টিসমূহকে পেতে পারেন। তিনি অত্যন্ত সুক্ষদর্শী, সুবিজ্ঞ।[ সুরা আনয়াম ৬ঃ১০১-১০৩ ]                                                       ', '2020-08-08 17:35:00', 4),
(25, 'কেয়ামতের আলামতঃ সুরা কাহাফ এবং সুরা নামল', '                    কেয়ামতের আলামত  মধ্যে থেকে এখানে কিছু বলা হয়েছে যেমনঃ ইয়াজুজ মাজুজ, দাব্বাতুল আরদের আবির্ভাব এবং পুনরায় হযরত ঈসা আঃ এর আগমনঃ\r\n               \r\nযুলকারনাইন বললেনঃ এটা আমার পালনকর্তার অনুগ্রহ। যখন আমার পালনকর্তার প্রতিশ্রুত সময় আসবে, তখন তিনি একে চূর্ণ-বিচূর্ণ করে দেবেন এবং আমার পালনকর্তার প্রতিশ্রুতি সত্য। আমি সেদিন তাদেরকে দলে দলে তরঙ্গের আকারে ছেড়ে দেব এবং শিঙ্গায় ফুঁৎকার দেয়া হবে। অতঃপর আমি তাদের সবাইকে একত্রিত করে আনব। [ সুরা কাহাফ ১৮ঃ৯৮-৯৯ ]\r\n\r\nযখন প্রতিশ্রুতি (কেয়ামত) সমাগত হবে, তখন আমি তাদের সামনে ভূগর্ভ থেকে একটি জীব নির্গত করব। সে মানুষের সাথে কথা বলবে। এ কারণে যে মানুষ আমার নিদর্শনসমূহে বিশ্বাস করত না। [ সুরা নাম’ল ২৭:৮২ ]\r\n\r\n \r\n                                ', '2020-08-08 18:11:00', 4),
(26, 'রিজিক শুধু আল্লাহর ইচ্ছাই বাড়ে এবং কমেঃ সুরা বাকারা', '&nbsp;পার্থিব জীবনের উপর কাফেরদিগকে উম্মত্ত করে দেয়া হয়েছে। আর তারা ঈমানদারদের প্রতি লক্ষ্য করে হাসাহাসি করে। পক্ষান্তরে যারা পরহেযগার তারা সেই কাফেরদের তুলনায় কেয়ামতের দিন অত্যন্ত উচ্চমর্যাদায় থাকবে। আর আল্লাহ যাকে ইচ্ছা সীমাহীন রুযী দান করেন। [&nbsp;সুরা বাকারা ২:২১২&nbsp;]\r\n', '2020-08-10 04:45:00', 4),
(27, 'সার্বভৌমত্বঃ আল্লাহ্‌ ছাড়া কোন মাবুদ নেই', 'আল্লাহ ছাড়া অন্য কোন উপাস্য নেই, তিনি জীবিত, সবকিছুর ধারক। তাঁকে তন্দ্রাও স্পর্শ করতে পারে না এবং নিদ্রাও নয়। আসমান ও যমীনে যা কিছু রয়েছে, সবই তাঁর। কে আছ এমন, যে সুপারিশ করবে তাঁর কাছে তাঁর অনুমতি ছাড়া? দৃষ্টির সামনে কিংবা পিছনে যা কিছু রয়েছে সে সবই তিনি জানেন। তাঁর জ্ঞানসীমা থেকে তারা কোন কিছুকেই পরিবেষ্টিত করতে পারে না, কিন্তু যতটুকু তিনি ইচ্ছা করেন। তাঁর সিংহাসন সমস্ত আসমান ও যমীনকে পরিবেষ্টিত করে আছে। আর সেগুলোকে ধারণ করা তাঁর পক্ষে কঠিন নয়। তিনিই সর্বোচ্চ এবং সর্বাপেক্ষা মহান। [&nbsp;সুরা বাকারা ২:২৫৫&nbsp;]\r\n\r\nআর তোমাদের উপাস্য একইমাত্র উপাস্য। তিনি ছাড়া মহা করুণাময় দয়ালু কেউ নেই। [&nbsp;সুরা বাকারা ২:১৬৩&nbsp;]\r\n', '2020-08-10 04:48:00', 4),
(28, 'আল্লাহ্‌ বিপদগ্রস্ত ব্যাক্তির দোয়া কবুল করেনঃ সুরা বাকারা', 'আর আমার বান্দারা যখন তোমার কাছে জিজ্ঞেস করে আমার ব্যাপারে বস্তুতঃ আমি রয়েছি সন্নিকটে। যারা প্রার্থনা করে, তাদের প্রার্থনা কবুল করে নেই, যখন আমার কাছে প্রার্থনা করে। কাজেই আমার হুকুম মান্য করা এবং আমার প্রতি নিঃসংশয়ে বিশ্বাস করা তাদের একান্ত কর্তব্য। যাতে তারা সৎপথে আসতে পারে। [&nbsp;সুরা বাকারা ২:১৮৬&nbsp;]&nbsp;\r\n', '2020-08-10 04:51:00', 4),
(29, 'কোরআন আল্লাহর কাছ থেকেই এসেছেঃ সুরা বাকারা ', 'এতদসম্পর্কে যদি তোমাদের কোন সন্দেহ থাকে যা আমি আমার বান্দার প্রতি অবতীর্ণ করেছি, তাহলে এর মত একটি সূরা রচনা করে নিয়ে এস। তোমাদের সেসব সাহায্যকারীদেরকে সঙ্গে নাও-এক আল্লাহকে ছাড়া, যদি তোমরা সত্যবাদী হয়ে থাকো। [&nbsp;সুরা বাকারা ২:২৩&nbsp;]\r\n\r\nআপনি বলে দিন, যে কেউ জিবরাঈলের শত্রু হয়-যেহেতু তিনি আল্লাহর আদেশে এ কালাম আপনার অন্তরে নাযিল করেছেন, যা সত্যায়নকারী তাদের সম্মুখস্থ কালামের এবং মুমিনদের জন্য পথপ্রদর্শক ও সুসংবাদদাতা। [&nbsp;সুরা বাকারা ২:৯৭&nbsp;]\r\n\r\nরমযান মাসই হল সে মাস, যাতে নাযিল করা হয়েছে কোরআন, যা মানুষের জন্য হেদায়েত এবং সত্যপথ যাত্রীদের জন্য সুষ্পষ্ট পথ নির্দেশ আর ন্যায় ও অন্যায়ের মাঝে পার্থক্য বিধানকারী। কাজেই তোমাদের মধ্যে যে লোক এ মাসটি পাবে, সে এ মাসের রোযা রাখবে। আর যে লোক অসুস্থ কিংবা মুসাফির অবস্থায় থাকবে সে অন্য দিনে গণনা পূরণ করবে। আল্লাহ তোমাদের জন্য সহজ করতে চান; তোমাদের জন্য জটিলতা কামনা করেন না যাতে তোমরা গণনা পূরণ কর এবং তোমাদের হেদায়েত দান করার দরুন আল্লাহ তা&#39;আলার মহত্ত্ব বর্ণনা কর, যাতে তোমরা কৃতজ্ঞতা স্বীকার কর। [&nbsp;সুরা বাকারা ২:১৮৫&nbsp;]\r\n', '2020-08-10 04:55:00', 4),
(30, 'কোরআনের মোজেজাঃ সুরা আল বাকারা', 'তুমি কি সে লোককে দেখনি যে এমন এক জনপদ দিয়ে যাচ্ছিল যার বাড়ীঘরগুলো ভেঙ্গে ছাদের উপর পড়ে ছিল? বলল, কেমন করে আল্লাহ মরনের পর একে জীবিত করবেন? অতঃপর আল্লাহ তাকে মৃত অবস্থায় রাখলেন একশ বছর। তারপর তাকে উঠালেন। বললেন, কত কাল এভাবে ছিলে? বলল আমি ছিলাম, একদিন কংবা একদিনের কিছু কম সময়। বললেন, তা নয়; বরং তুমি তো একশ বছর ছিলে। এবার চেয়ে দেখ নিজের খাবার ও পানীয়ের দিকে-সেগুলো পচে যায় নি এবং দেখ নিজের গাধাটির দিকে। আর আমি তোমাকে মানুষের জন্য দৃষ্টান্ত বানাতে চেয়েছি। আর হাড়গুলোর দিকে চেয়ে দেখ যে, আমি এগুলোকে কেমন করে জুড়ে দেই এবং সেগুলোর উপর মাংসের আবরণ পরিয়ে দেই। অতঃপর যখন তার উপর এ অবস্থা প্রকাশিত হল, তখন বলে উঠল-আমি জানি, নিঃসন্দেহে আল্লাহ সর্ব বিষয়ে ক্ষমতাশীল। [&nbsp;সুরা বাকারা ২:২৫৯&nbsp;]\r\n\r\nআর স্মরণ কর, যখন ইব্রাহীম বলল, হে আমার পালনকর্তা আমাকে দেখাও, কেমন করে তুমি মৃতকে জীবিত করবে। বললেন; তুমি কি বিশ্বাস কর না? বলল, অবশ্যই বিশ্বাস করি, কিন্তু দেখতে এজন্যে চাইছি যাতে অন্তরে প্রশান্তি লাভ করতে পারি। বললেন, তাহলে চারটি পাখী ধরে নাও। পরে সেগুলোকে নিজের পোষ মানিয়ে নাও, অতঃপর সেগুলোর দেহের একেকটি অংশ বিভিন্ন পাহাড়ের উপর রেখে দাও। তারপর সেগুলোকে ডাক; তোমার নিকট দৌড়ে চলে আসবে। আর জেনে রাখো, নিশ্চয়ই আল্লাহ পরাক্রমশালী, অতি জ্ঞান সম্পন্ন। [&nbsp;সুরা বাকারা ২:২৬০&nbsp;]\r\n', '2020-08-10 05:00:00', 4),
(31, 'কেয়ামতঃ কেয়ামতের দিন কেউ কারো কাজে আসবে না', '&nbsp;আর কোন লোক এমনও রয়েছে যারা অন্যান্যকে আল্লাহর সমকক্ষ সাব্যস্ত করে এবং তাদের প্রতি তেমনি ভালবাসা পোষণ করে, যেমন আল্লাহর প্রতি ভালবাসা হয়ে থাকে। কিন্তু যারা আল্লাহর প্রতি ঈমানদার তাদের ভালবাসা ওদের তুলনায় বহুগুণ বেশী। আর কতইনা উত্তম হ&#39;ত যদি এ জালেমরা পার্থিব কোন কোন আযাব প্রত্যক্ষ করেই উপলব্ধি করে নিত যে, যাবতীয় ক্ষমতা শুধুমাত্র আল্লাহরই জন্য এবং আল্লাহর আযাবই সবচেয়ে কঠিনতর। অনুসৃতরা যখন অনুসরণকারীদের প্রতি অসন্তুষ্ট হয়ে যাবে এবং যখন আযাব প্রত্যক্ষ করবে আর বিচ্ছিন্ন হয়ে যাবে তাদের পারস্পরিক সমস্ত সম্পর্ক। এবং অনুসারীরা বলবে, কতইনা ভাল হত, যদি আমাদিগকে পৃথিবীতে ফিরে যাবার সুযোগ দেয়া হত। তাহলে আমরাও তাদের প্রতি তেমনি অসন্তুষ্ট হয়ে যেতাম, যেমন তারা অসন্তুষ্ট হয়েছে আমাদের প্রতি। এভাবেই আল্লাহ তা&#39;আলা তাদেরকে দেখাবেন তাদের কৃতকর্ম তাদেরকে অনুতপ্ত করার জন্যে। অথচ, তারা কস্মিনকালেও আগুন থেকে বের হতে পারবে না। [&nbsp;সুরা বাকারা ২:১৬৫-১৬৭&nbsp;]\r\n\r\n&nbsp;\r\n', '2020-08-10 05:08:00', 4),
(32, 'পিরিয়ড বা ঋতুস্রাব এর মাসায়ালা ', '                                                             \r\n\r\nআর তোমার কাছে জিজ্ঞেস করে হায়েয (ঋতু) সম্পর্কে। বলে দাও, এটা অশুচি। কাজেই তোমরা হায়েয অবস্থায় স্ত্রীগমন থেকে বিরত থাক। তখন পর্যন্ত তাদের নিকটবর্তী হবে না, যতক্ষণ না তারা পবিত্র হয়ে যায়। যখন উত্তম রূপে পরিশুদ্ধ হয়ে যাবে, তখন গমন কর তাদের কাছে, যেভাবে আল্লাহ তোমাদেরকে হুকুম দিয়েছেন। নিশ্চয়ই আল্লাহ তওবাকারী এবং অপবিত্রতা থেকে যারা বেঁচে থাকে তাদেরকে পছন্দ করেন। [ সুরা বাকারা ২:২২২ ]\r\n                                                ', '2020-08-10 05:24:00', 4),
(33, 'নামাজ হেফাজতের গুরুত্ব ', 'সমস্ত নামাযের প্রতি যত্নবান হও, বিশেষ করে মধ্যবর্তী নামাযের ব্যাপারে। আর আল্লাহর সামনে একান্ত আদবের সাথে দাঁড়াও। [&nbsp;সুরা বাকারা ২:২৩৮&nbsp;]\r\n', '2020-08-10 05:12:00', 4),
(34, 'যাকাত, সদকাহ এবং তা ব্যয়ের খাতসমুহঃ সুরা বাকারা', 'যদি তোমরা প্রকাশ্যে দান-খয়রাত কর, তবে তা কতইনা উত্তম। আর যদি খয়রাত গোপনে কর এবং অভাবগ্রস্তদের দিয়ে দাও, তবে তা তোমাদের জন্যে আরও উত্তম। আল্লাহ তা&#39;আলা তোমাদের কিছু গোনাহ দূর করে দিবেন। আল্লাহ তোমাদের কাজ কর্মের খুব খবর রাখেন। [&nbsp;সুরা বাকারা ২:২৭১&nbsp;]\r\n\r\nযারা স্বীয় ধন-সম্পদ ব্যয় করে, রাত্রে ও দিনে, গোপনে ও প্রকাশ্যে। তাদের জন্যে তাদের সওয়াব রয়েছে তাদের পালনকর্তার কাছে। তাদের কোন আশংঙ্কা নেই এবং তারা চিন্তিত ও হবে না। [&nbsp;সুরা বাকারা ২:২৭৪&nbsp;]\r\n', '2020-08-10 05:16:00', 4),
(35, 'রোজা, এতেকাফ এবং লাইলাতুল কদরঃ সুরা বাকারা ', 'হে ঈমানদারগণ! তোমাদের উপর রোজা ফরয করা হয়েছে, যেরূপ ফরজ করা হয়েছিল তোমাদের পূর্ববর্তী লোকদের উপর, যেন তোমরা পরহেযগারী অর্জন করতে পার।&nbsp;গণনার কয়েকটি দিনের জন্য অতঃপর তোমাদের মধ্যে যে, অসুখ থাকবে অথবা সফরে থাকবে, তার পক্ষে অন্য সময়ে সে রোজা পূরণ করে নিতে হবে। আর এটি যাদের জন্য অত্যন্ত কষ্ট দায়ক হয়, তারা এর পরিবর্তে একজন মিসকীনকে খাদ্যদান করবে। যে ব্যক্তি খুশীর সাথে সৎকর্ম করে, তা তার জন্য কল্যাণ কর হয়। আর যদি রোজা রাখ, তবে তোমাদের জন্যে বিশেষ কল্যাণকর, যদি তোমরা তা বুঝতে পার।রমযান মাসই হল সে মাস, যাতে নাযিল করা হয়েছে কোরআন, যা মানুষের জন্য হেদায়েত এবং সত্যপথ যাত্রীদের জন্য সুষ্পষ্ট পথ নির্দেশ আর ন্যায় ও অন্যায়ের মাঝে পার্থক্য বিধানকারী। কাজেই তোমাদের মধ্যে যে লোক এ মাসটি পাবে, সে এ মাসের রোযা রাখবে। আর যে লোক অসুস্থ কিংবা মুসাফির অবস্থায় থাকবে সে অন্য দিনে গণনা পূরণ করবে। আল্লাহ তোমাদের জন্য সহজ করতে চান; তোমাদের জন্য জটিলতা কামনা করেন না যাতে তোমরা গণনা পূরণ কর এবং তোমাদের হেদায়েত দান করার দরুন আল্লাহ তা&#39;আলার মহত্ত্ব বর্ণনা কর, যাতে তোমরা কৃতজ্ঞতা স্বীকার কর। [&nbsp;সুরা বাকারা ২:১৮৩-১৮৫&nbsp;]\r\n', '2020-08-10 05:19:00', 4),
(36, 'হজ্জঃ হজ্জের মহান দিন', 'হজ্জ্বে কয়েকটি মাস আছে সুবিদিত। এসব মাসে যে লোক হজ্জ্বের পরিপূর্ণ নিয়ত করবে, তার পক্ষে স্ত্রীও সাথে নিরাভরণ হওয়া জায়েজ নয়। না অশোভন কোন কাজ করা, না ঝাগড়া-বিবা দ করা হজ্জ্বের সেই সময় জায়েজ নয়। আর তোমরা যাকিছু সৎকাজ কর, আল্লাহ তো জানেন। আর তোমরা পাথেয় সাথে নিয়ে নাও। নিঃসন্দেহে সর্বোত্তম পাথেয় হচ্ছে আল্লাহর ভয়। আর আমাকে ভয় করতে থাক, হে বুদ্ধিমানগন! তোমাদের উপর তোমাদের পালনকর্তার অনুগ্রহ অন্বেষণ করায় কোন পাপ নেই। [&nbsp;সুরা বাকারা ২:১৯৭&nbsp;]\r\n', '2020-08-10 05:29:00', 4),
(37, 'হজ্জঃ ওমরার বর্ণনা', 'আর তোমরা আল্লাহর উদ্দেশ্যে হজ্জ্ব ওমরাহ পরিপূর্ণ ভাবে পালন কর। যদি তোমরা বাধা প্রাপ্ত হও, তাহলে কোরবানীর জন্য যাকিছু সহজলভ্য, তাই তোমাদের উপর ধার্য। আর তোমরা ততক্ষণ পর্যন্ত মাথা মুন্ডন করবে না, যতক্ষণ না কোরবাণী যথাস্থানে পৌছে যাবে। যারা তোমাদের মধ্যে অসুস্থ হয়ে পড়বে কিংবা মাথায় যদি কোন কষ্ট থাকে, তাহলে তার পরিবর্তে রোজা করবে কিংবা খয়রাত দেবে অথবা কুরবানী করবে। আর তোমাদের মধ্যে যারা হজ্জ্ব ওমরাহ একত্রে একই সাথে পালন করতে চাও, তবে যাকিছু সহজলভ্য, তা দিয়ে কুরবানী করাই তার উপর কর্তব্য। বস্তুতঃ যারা কোরবানীর পশু পাবে না, তারা হজ্জ্বের দিনগুলোর মধ্যে রোজা রাখবে তিনটি আর সাতটি রোযা রাখবে ফিরে যাবার পর। এভাবে দশটি রোযা পূর্ণ হয়ে যাবে। এ নির্দেশটি তাদের জন্য, যাদের পরিবার পরিজন মসজিদুল হারামের আশে-পাশে বসবাস করে না। আর আল্লাহকে ভয় করতে থাক। সন্দেহাতীতভাবে জেনো যে, আল্লাহর আযাব বড়ই কঠিন। [&nbsp;সুরা বাকারা ২:১৯৬&nbsp;]\r\n', '2020-08-10 05:31:00', 4),
(38, 'নারী এবং পারিবারিক জীবনঃ যেসব মহিলাদের বিয়ে করা হারাম-সুরা বাকারা', 'আর তোমরা মুশরেক নারীদেরকে বিয়ে করোনা, যতক্ষণ না তারা ঈমান গ্রহণ করে। অবশ্য মুসলমান ক্রীতদাসী মুশরেক নারী অপেক্ষা উত্তম, যদিও তাদেরকে তোমাদের কাছে ভালো লাগে। এবং তোমরা (নারীরা) কোন মুশরেকের সঙ্গে বিবাহ বন্ধনে আবদ্ধ হয়ো না, যে পর্যন্ত সে ঈমান না আনে। একজন মুসলমান ক্রীতদাসও একজন মুশরেকের তুলনায় অনেক ভাল, যদিও তোমরা তাদের দেখে মোহিত হও। তারা দোযখের দিকে আহ্বান করে, আর আল্লাহ নিজের হুকুমের মাধ্যমে আহ্বান করেন জান্নাত ও ক্ষমার দিকে। আর তিনি মানুষকে নিজের নির্দেশ বাতলে দেন যাতে তারা উপদেশ গ্রহণ করে। [&nbsp;সুরা বাকারা ২:২২১&nbsp;]\r\n', '2020-08-10 05:34:00', 4),
(39, 'নারী ও পারিবারিক জীবনঃ তালাকের বিধান ', 'আর যখন তোমরা স্ত্রীদেরকে তালাক দিয়ে দাও, অতঃপর তারা নির্ধারিত ইদ্দত সমাপ্ত করে নেয়, তখন তোমরা নিয়ম অনুযায়ী তাদেরকে রেখে দাও অথবা সহানুভুতির সাথে তাদেরকে মুক্ত করে দাও। আর তোমরা তাদেরকে জ্বালাতন ও বাড়াবাড়ি করার উদ্দেশ্যে আটকে রেখো না। আর যারা এমন করবে, নিশ্চয়ই তারা নিজেদেরই ক্ষতি করবে। আর আল্লাহর নির্দেশকে হাস্যকর বিষয়ে পরিণত করো না। আল্লাহর সে অনুগ্রহের কথা স্মরণ কর, যা তোমাদের উপর রয়েছে এবং তাও স্মরণ কর, যে কিতাব ও জ্ঞানের কথা তোমাদের উপর নাযিল করা হয়েছে যার দ্বারা তোমাদেরকে উপদেশ দান করা হয়। আল্লাহকে ভয় কর এবং জেনে রাখ যে, আল্লাহ সর্ববিষয়েই জ্ঞানময়। [&nbsp;সুরা বাকারা ২:২৩১&nbsp;]\r\n\r\nআর যখন তোমরা স্ত্রীদেরকে তালাক দিয়ে দাও এবং তারপর তারাও নির্ধারিত ইদ্দত পূর্ন করতে থাকে, তখন তাদেরকে পূর্ব স্বামীদের সাথে পারস্পরিক সম্মতির ভিত্তিতে নিয়মানুযায়ী বিয়ে করতে বাধাদান করো না। এ উপদেশ তাকেই দেয়া হচ্ছে, যে আল্লাহ ও কেয়ামত দিনের উপর বিশ্বাস স্থাপন করেছে। এর মধ্যে তোমাদের জন্য রয়েছে একান্ত পরিশুদ্ধতা ও অনেক পবিত্রতা। আর আল্লাহ জানেন, তোমরা জান না। [&nbsp;সুরা বাকারা ২:২৩২&nbsp;]\r\n', '2020-08-10 05:40:00', 4),
(40, 'নারী ও পারিবারিক জীবনঃ বিধবার ইদ্দতের বিধান', 'আর তোমাদের মধ্যে যারা মৃত্যুবরণ করবে এবং নিজেদের স্ত্রীদেরকে ছেড়ে যাবে, তখন সে স্ত্রীদের কর্তব্য হলো নিজেকে চার মাস দশ দিন পর্যন্ত অপেক্ষা করিয়ে রাখা। তারপর যখন ইদ্দত পূর্ণ করে নেবে, তখন নিজের ব্যাপারে নীতি সঙ্গত ব্যবস্থা নিলে কোন পাপ নেই। আর তোমাদের যাবতীয় কাজের ব্যাপারেই আল্লাহর অবগতি রয়েছে। [&nbsp;সুরা বাকারা ২:২৩৪&nbsp;]\r\n\r\n&nbsp;\r\n\r\nআর যখন তোমাদের মধ্যে যারা মৃত্যুবরণ করবে তখন স্ত্রীদের ঘর থেকে বের না করে এক বছর পর্যন্ত তাদের খরচের ব্যাপারে ওসিয়ত করে যাবে। অতঃপর যদি সে স্ত্রীরা নিজে থেকে বেরিয়ে যায়, তাহলে সে নারী যদি নিজের ব্যাপারে কোন উত্তম ব্যবস্থা করে, তবে তাতে তোমাদের উপর কোন পাপ নেই। আর আল্লাহ হচ্ছেন পরাক্রমশালী বিজ্ঞতা সম্পন্ন। [&nbsp;সুরা বাকারা ২:২৪০&nbsp;]\r\n', '2020-08-10 05:43:00', 4),
(41, 'অর্থনীতিঃ ক্রয় এবং বিক্রয়ের বিধি বিধান ', 'হে মুমিনগণ! যখন তোমরা কোন নির্দিষ্ট সময়ের জন্যে ঋনের আদান-প্রদান কর, তখন তা লিপিবদ্ধ করে নাও এবং তোমাদের মধ্যে কোন লেখক ন্যায়সঙ্গতভাবে তা লিখে দেবে; লেখক লিখতে অস্বীকার করবে না। আল্লাহ তাকে যেমন শিক্ষা দিয়েছেন, তার উচিত তা লিখে দেয়া। এবং ঋন গ্রহীতা যেন লেখার বিষয় বলে দেয় এবং সে যেন স্বীয় পালনকর্তা আল্লাহকে ভয় করে এবং লেখার মধ্যে বিন্দুমাত্রও বেশ কম না করে। অতঃপর ঋণগ্রহীতা যদি নির্বোধ হয় কিংবা দূর্বল হয় অথবা নিজে লেখার বিষয়বস্তু বলে দিতে অক্ষম হয়, তবে তার অভিভাবক ন্যায়সঙ্গতভাবে লিখাবে। দুজন সাক্ষী কর, তোমাদের পুরুষদের মধ্যে থেকে। যদি দুজন পুরুষ না হয়, তবে একজন পুরুষ ও দুজন মহিলা। ঐ সাক্ষীদের মধ্য থেকে যাদেরকে তোমরা পছন্দ কর যাতে একজন যদি ভুলে যায়, তবে একজন অন্যজনকে স্মরণ করিয়ে দেয়। যখন ডাকা হয়, তখন সাক্ষীদের অস্বীকার করা উচিত নয়। তোমরা এটা লিখতে অলসতা করোনা, তা ছোট হোক কিংবা বড়, নির্দিষ্ট সময় পর্যন্ত। এ লিপিবদ্ধ করণ আল্লাহর কাছে সুবিচারকে অধিক কায়েম রাখে, সাক্ষ্যকে অধিক সুসংহত রাখে এবং তোমাদের সন্দেহে পতিত না হওয়ার পক্ষে অধিক উপযুক্ত। কিন্তু যদি কারবার নগদ হয়, পরস্পর হাতে হাতে আদান-প্রদান কর, তবে তা না লিখলে তোমাদের প্রতি কোন অভিযোগ নেই। তোমরা ক্রয়-বিক্র য়ের সময় সাক্ষী রাখ। কোন লেখক ও সাক্ষীকে ক্ষতিগ্রস্ত করো না। যদি তোমরা এরূপ কর, তবে তা তোমাদের পক্ষে পাপের বিষয়। আল্লাহকে ভয় কর তিনি তোমাদেরকে শিক্ষা দেন। আল্লাহ সব কিছু জানেন। [&nbsp;সুরা বাকারা ২:২৮২&nbsp;]\r\n\r\nআর তোমরা যদি প্রবাসে থাক এবং কোন লেখক না পাও তবে বন্ধকী বন্তু হস্তগত রাখা উচিত। যদি একে অন্যকে বিশ্বাস করে, তবে যাকে বিশ্বাস করা হয়, তার উচিত অন্যের প্রাপ্য পরিশোধ করা এবং স্বীয় পালনকর্তা আল্লাহকে ভয় কর! তোমরা সাক্ষ্য গোপন করো না। যে কেউ তা গোপন করবে, তার অন্তর পাপপূর্ণ হবে। তোমরা যা করা, আল্লাহ সে সম্পর্কে খুব জ্ঞাত। [&nbsp;সুরা বাকারা ২:২৮৩&nbsp;]\r\n', '2020-08-10 05:48:00', 4),
(42, 'অর্থনীতিঃ সুদ হারাম - সুরা বাকারা ', '                                        যারা সুদ খায়, তারা কিয়ামতে দন্ডায়মান হবে, যেভাবে দন্ডায়মান হয় ঐ ব্যক্তি, যাকে শয়তান আসর করে মোহাবিষ্ট করে দেয়। তাদের এ অবস্থার কারণ এই যে, তারা বলেছেঃ ক্রয়-বিক্র য় ও তো সুদ নেয়ারই মত! অথচ আল্লাহ তা\'আলা ক্রয়-বিক্রয় বৈধ করেছেন এবং সুদ হারাম করেছেন। অতঃপর যার কাছে তার পালনকর্তার পক্ষ থেকে উপদেশ এসেছে এবং সে বিরত হয়েছে, পূর্বে যা হয়ে গেছে, তা তার। তার ব্যাপার আল্লাহর উপর নির্ভরশীল। আর যারা পুনরায় সুদ নেয়, তারাই দোযখে যাবে। তারা সেখানে চিরকাল অবস্থান করবে। [ সুরা বাকারা ২:২৭৫ ]\r\n\r\nহে ঈমানদারগণ, তোমরা আল্লাহকে ভয় কর এবং সুদের যে সমস্ত বকেয়া আছে, তা পরিত্যাগ কর, যদি তোমরা ঈমানদার হয়ে থাক। [ সুরা বাকারা ২:২৭৮ ]\r\n\r\nঅতঃপর যদি তোমরা পরিত্যাগ না কর, তবে আল্লাহ ও তাঁর রসূলের সাথে যুদ্ধ করতে প্রস্তুত হয়ে যাও। কিন্তু যদি তোমরা তওবা কর, তবে তোমরা নিজের মূলধন পেয়ে যাবে। তোমরা কারও প্রতি অত্যাচার করো না এবং কেউ তোমাদের প্রতি অত্যাচার করবে না। [ সুরা বাকারা ২:২৭৯ ]\r\n\r\nযদি খাতক অভাবগ্রস্থ হয়, তবে তাকে সচ্ছলতা আসা পর্যন্ত সময় দেয়া উচিত। আর যদি ক্ষমা করে দাও, তবে তা খুবই উত্তম যদি তোমরা উপলব্ধি কর। [ সুরা বাকারা ২:২৮০ ]\r\n                                ', '2020-08-10 19:22:00', 4),
(43, 'জেহাদঃ ইসলাম গ্রহনে কাউকে বাধ্য করা যাবে না ', 'দ্বীনের ব্যাপারে কোন জবরদস্তি বা বাধ্য-বাধকতা&nbsp;নেই। নিঃসন্দেহে হেদায়াত গোমরাহী থেকে পৃথক হয়ে গেছে। এখন যারা গোমরাহকারী `তাগুতদেরকে মানবে না এবং আল্লাহতে বিশ্বাস স্থাপন করবে, সে ধারণ করে নিয়েছে সুদৃঢ় হাতল যা ভাংবার নয়। আর আল্লাহ সবই শুনেন এবং জানেন। [&nbsp;সুরা বাকারা ২:২৫৬&nbsp;]\r\n\r\nযারা ঈমান এনেছে, আল্লাহ তাদের অভিভাবক। তাদেরকে তিনি বের করে আনেন অন্ধকার থেকে আলোর দিকে। আর যারা কুফরী করে তাদের অভিভাবক হচ্ছে তাগুত। তারা তাদেরকে আলো থেকে বের করে অন্ধকারের দিকে নিয়ে যায়। এরাই হলো দোযখের অধিবাসী, চিরকাল তারা সেখানেই থাকবে। [&nbsp;সুরা বাকারা ২:২৫৭&nbsp;]\r\n', '2020-08-10 05:55:00', 4),
(44, 'বান্দার হকঃ এতিমদের আলোচনা', 'দুনিয়া ও আখেরাতের বিষয়ে। আর তোমার কাছে জিজ্ঞেস করে, এতীম সংক্রান্ত হুকুম। বলে দাও, তাদের কাজ-কর্ম সঠিকভাবে গুছিয়ে দেয়া উত্তম আর যদি তাদের ব্যয়ভার নিজের সাথে মিশিয়ে নাও, তাহলে মনে করবে তারা তোমাদের ভাই । বস্তুতঃ অমঙ্গলকামী ও মঙ্গলকামীদেরকে আল্লাহ জানেন। আল্লাহ যদি ইচ্ছা করতেন, তাহলে তোমাদের উপর জটিলতা আরোপ করতে পারতেন। নিশ্চয়ই তিনি পরাক্রমশালী, মহাপ্রজ্ঞ। [&nbsp;সুরা বাকারা ২:২২০&nbsp;]\r\n', '2020-08-10 06:00:00', 4),
(45, 'বান্দার হকঃ গোপন দান', 'যারা স্বীয় ধন সম্পদ আল্লাহর রাস্তায় ব্যয় করে, এরপর ব্যয় করার পর সে অনুগ্রহের কথা প্রকাশ করে না এবং কষ্টও দেয় না, তাদেরই জন্যে তাদের পালনকর্তার কাছে রয়েছে পুরস্কার এবং তাদের কোন আশংকা নেই, তারা চিন্তিতও হবে না। [&nbsp;সুরা বাকারা ২:২৬২&nbsp;]\r\n\r\n&nbsp;\r\n', '2020-08-10 06:04:00', 4),
(46, 'কোরআনের দোয়াসমুহঃ সুরা বাকারা ', '                    وِمِنْهُم مَّن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\r\n\r\nআর তাদের মধ্যে কেউ কেউ বলে-হে পরওয়ারদেগার! আমাদিগকে দুনয়াতেও কল্যাণ দান কর এবং আখেরাতেও কল্যাণ দান কর এবং আমাদিগকে দোযখের আযাব থেকে রক্ষা কর। [ সুরা বাকারা ২:২০১ ]\r\n\r\nاَ يُكَلِّفُ اللّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\r\n\r\nআল্লাহ কাউকে তার সাধ্যাতীত কোন কাজের ভার দেন না, সে তাই পায় যা সে উপার্জন করে এবং তাই তার উপর বর্তায় যা সে করে। হে আমাদের পালনকর্তা, যদি আমরা ভুলে যাই কিংবা ভুল করি, তবে আমাদেরকে অপরাধী করো না। হে আমাদের পালনকর্তা! এবং আমাদের উপর এমন দায়িত্ব অর্পণ করো না, যেমন আমাদের পূর্ববর্তীদের উপর অর্পণ করেছ, হে আমাদের প্রভূ! এবং আমাদের দ্বারা ঐ বোঝা বহন করিও না, যা বহন করার শক্তি আমাদের নাই। আমাদের পাপ মোচন কর। আমাদেরকে ক্ষমা কর এবং আমাদের প্রতি দয়া কর। তুমিই আমাদের প্রভু। সুতরাং কাফের সম্প্রদায়ের বিরুদ্ধে আমাদের কে সাহায্যে কর। [ সুরা বাকারা ২:২৮৬ ]\r\n                ', '2020-08-10 06:07:00', 4),
(47, 'মোমেনের গুনাবলিঃ সুরা বাকারা ', '                    যারা অদেখা বিষয়ের উপর বিশ্বাস স্থাপন করে এবং নামায প্রতিষ্ঠা করে। আর আমি তাদেরকে যে রুযী দান করেছি তা থেকে ব্যয় করে [ সুরা বাকারা ২:৩ ]\r\n\r\nএবং যারা বিশ্বাস স্থাপন করেছে সেসব বিষয়ের উপর যা কিছু তোমার প্রতি অবতীর্ণ হয়েছে এবং সেসব বিষয়ের উপর যা তোমার পূর্ববর্তীদের প্রতি অবতীর্ণ হয়েছে। আর আখেরাতকে যারা নিশ্চিত বলে বিশ্বাস করে। [ সুরা বাকারা ২:৪ ]\r\n\r\nতারাই নিজেদের পালনকর্তার পক্ষ থেকে সুপথ প্রাপ্ত, আর তারাই যথার্থ সফলকাম। [ সুরা বাকারা ২:৫ ]\r\n                ', '2020-08-10 06:42:00', 4),
(48, 'কোরআনের ঘটনা সমুহঃ হযরত আদম (আঃ) এবং হাওয়া (আঃ) এবং ইবলিস ', '                       আর তোমার পালনকর্তা যখন ফেরেশতাদিগকে বললেনঃ আমি পৃথিবীতে একজন প্রতিনিধি বানাতে যাচ্ছি, তখন ফেরেশতাগণ বলল, তুমি কি পৃথিবীতে এমন কাউকে সৃষ্টি করবে যে দাঙ্গা-হাঙ্ গামার সৃষ্টি করবে এবং রক্তপাত ঘটাবে? অথচ আমরা নিয়ত তোমার গুণকীর্তন করছি এবং তোমার পবিত্র সত্তাকে স্মরণ করছি। তিনি বললেন, নিঃসন্দেহে আমি জানি, যা তোমরা জান না।আর আল্লাহ তাআলা শিখালেন আদমকে সমস্ত বস্তু-সামগ্ রীর নাম। তারপর সে সমস্ত বস্তু-সামগ্রীরীকে ফেরেশতাদের সামনে উপস্থাপন করলেন। অতঃপর বললেন, আমাকে তোমরা এগুলোর নাম বলে দাও, যদি তোমরা সত্য হয়ে থাক।তারা বলল, তুমি পবিত্র! আমরা কোন কিছুই জানি না, তবে তুমি যা আমাদিগকে শিখিয়েছ (সেগুলো ব্যতীত) নিশ্চয় তুমিই প্রকৃত জ্ঞানসম্পন্ন, হেকমতওয়ালা।তিনি বললেন, হে আদম, ফেরেশতাদেরকে বলে দাও এসবের নাম। তারপর যখন তিনি বলে দিলেন সে সবের নাম, তখন তিনি বললেন, আমি কি তোমাদেরকে বলিনি যে, আমি আসমান ও যমীনের যাবতীয় গোপন বিষয় সম্পর্কে খুব ভাল করেই অবগত রয়েছি? এবং সেসব বিষয়ও জানি যা তোমরা প্রকাশ কর, আর যা তোমরা গোপন কর!এবং যখন আমি হযরত আদম (আঃ)-কে সেজদা করার জন্য ফেরেশতাগণকে নির্দেশ দিলাম, তখনই ইবলীস ব্যতীত সবাই সিজদা করলো। সে (নির্দেশ) পালন করতে অস্বীকার করল এবং অহংকার প্রদর্শন করল। ফলে সে কাফেরদের অন্তর্ভূক্ত হয়ে গেল।এবং আমি আদমকে হুকুম করলাম যে, তুমি ও তোমার স্ত্রী জান্নাতে বসবাস করতে থাক এবং ওখানে যা চাও, যেখান থেকে চাও, পরিতৃপ্তিসহ খেতে থাক, কিন্তু এ গাছের নিকটবর্তী হয়ো না। অন্যথায় তোমরা যালিমদের অন্তর্ভূক্ত হয়ে পড়বে।অনন্তর শয়তান তাদের উভয়কে ওখান থেকে পদস্খলিত করেছিল। পরে তারা যে সুখ-স্বাচ্ছ ন্দ্যে ছিল তা থেকে তাদেরকে বের করে দিল এবং আমি বললাম, তোমরা নেমে যাও। তোমরা পরস্পর একে অপরের শক্র হবে এবং তোমাদেরকে সেখানে কিছুকাল অবস্থান করতে হবে ও লাভ সংগ্রহ করতে হবে।অতঃপর হযরত আদম (আঃ) স্বীয় পালনকর্তার কাছ থেকে কয়েকটি কথা শিখে নিলেন, অতঃপর আল্লাহ পাক তাঁর প্রতি (করুণাভরে) লক্ষ্য করলেন। নিশ্চয়ই তিনি মহা-ক্ষমাশী ল ও অসীম দয়ালু।আমি হুকুম করলাম, তোমরা সবাই নীচে নেমে যাও। অতঃপর যদি তোমাদের নিকট আমার পক্ষ থেকে কোন হেদায়েত পৌঁছে, তবে যে ব্যক্তি আমার সে হেদায়েত অনুসারে চলবে, তার উপর না কোন ভয় আসবে, না (কোন কারণে) তারা চিন্তাগ্রস্ত ও সন্তপ্ত হবে।আর যে লোক তা অস্বীকার করবে এবং আমার নিদর্শনগুলোকে মিথ্যা প্রতিপন্ন করার প্রয়াস পাবে, তারাই হবে জাহান্নামবাসী এবং অন্তকাল সেখানে থাকবে। [ সুরা বাকারা ২:৩০-৩৯ ]                 ', '2020-08-10 06:33:00', 4),
(50, 'কোরআনের ঘটনা সমুহঃ হযরত ইব্রাহিম (আঃ) এবং হযরত ইসমাইল (আঃ)', '                                                             যখন ইব্রাহীমকে তাঁর পালনকর্তা কয়েকটি বিষয়ে পরীক্ষা করলেন, অতঃপর তিনি তা পূর্ণ করে দিলেন, তখন পালনকর্তা বললেন, আমি তোমাকে মানবজাতির নেতা করব। তিনি বললেন, আমার বংশধর থেকেও! তিনি বললেন আমার অঙ্গীকার অত্যাচারীদের পর্যন্ত পৌঁছাবে না। [ সুরা বাকারা ২:১২৪ ] যখন আমি কাবা গৃহকে মানুষের জন্যে সম্মিলন স্থল ও শান্তির আলয় করলাম, আর তোমরা ইব্রাহীমের দাঁড়ানোর জায়গাকে নামাযের জায়গা বানাও এবং আমি ইব্রাহীম ও ইসমাঈলকে আদেশ করলাম, তোমরা আমার গৃহকে তওয়াফকারী, অবস্থানকারী ও রুকু-সেজদাকারীদের জন্য পবিত্র রাখ। [ সুরা বাকারা ২:১২৫ ] যখন ইব্রাহীম বললেন, পরওয়ারদেগার! এ স্থানকে তুমি শান্তিধান কর এবং এর অধিবাসীদের মধ্যে যারা অল্লাহ ও কিয়ামতে বিশ্বাস করে, তাদেরকে ফলের দ্বারা রিযিক দান কর। বললেনঃ যারা অবিশ্বাস করে, আমি তাদেরও কিছুদিন ফায়দা ভোগ করার সুযোগ দেব, অতঃপর তাদেরকে বলপ্রয়োগে দোযখের আযাবে ঠেলে দেবো; সেটা নিকৃষ্ট বাসস্থান। [ সুরা বাকারা ২:১২৬ ] স্মরণ কর, যখন ইব্রাহীম ও ইসমাঈল কাবাগৃহের ভিত্তি স্থাপন করছিল। তারা দোয়া করেছিলঃ পরওয়ারদেগার! আমাদের থেকে কবুল কর। নিশ্চয়ই তুমি শ্রবণকারী, সর্বজ্ঞ। [ সুরা বাকারা ২:১২৭ ] পরওয়ারদেগার! আমাদের উভয়কে তোমার আজ্ঞাবহ কর এবং আমাদের বংশধর থেকেও একটি অনুগত দল সৃষ্টি কর, আমাদের হজ্বের রীতিনীতি বলে দাও এবং আমাদের ক্ষমা কর। নিশ্চয় তুমি তওবা কবুলকারী। দয়ালু। [ সুরা বাকারা ২:১২৮ ] হে পরওয়ারদেগার! তাদের মধ্যে থেকেই তাদের নিকট একজন পয়গম্বর প্রেরণ করুণ যিনি তাদের কাছে তোমার আয়াতসমূহ তেলাওয়াত করবেন, তাদেরকে কিতাব ও হেকমত শিক্ষা দিবেন। এবং তাদের পবিত্র করবেন। নিশ্চয় তুমিই পরাক্রমশালী হেকমতওয়ালা। [ সুরা বাকারা ২:১২৯ ] ইব্রাহীমের ধর্ম থেকে কে মুখ ফেরায়? কিন্তু সে ব্যক্তি, যে নিজেকে বোকা প্রতিপন্ন করে। নিশ্চয়ই আমি তাকে পৃথিবীতে মনোনীত করেছি এবং সে পরকালে সৎকর্মশীলদের অন্তর্ভুক্ত। [ সুরা বাকারা ২:১৩০ ]   স্মরণ কর, যখন তাকে তার পালনকর্তা বললেনঃ অনুগত হও। সে বললঃ আমি বিশ্বপালকের অনুগত হলাম। [ সুরা বাকারা ২:১৩১ ]   এরই ওছিয়ত করেছে ইব্রাহীম তার সন্তানদের এবং ইয়াকুবও যে, হে আমার সন্তানগণ, নিশ্চয় আল্লাহ তোমাদের জন্য এ ধর্মকে মনোনীত করেছেন। কাজেই তোমরা মুসলমান না হয়ে কখনও মৃত্যুবরণ করো না। [ সুরা বাকারা ২:১৩২ ]                                 ', '2020-08-10 19:22:00', 4);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `user_id` int(11) NOT NULL,
  `first_name` varchar(30) NOT NULL,
  `last_name` varchar(30) NOT NULL,
  `username` varchar(100) DEFAULT NULL,
  `password` varchar(40) DEFAULT NULL,
  `role` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`user_id`, `first_name`, `last_name`, `username`, `password`, `role`) VALUES
(2, 'Nahid', 'Hasan', 'nahidhasan', '53c8f03f8cd8947ab96c056a8dd69fab', 0),
(4, 'Quran', 'portal', 'quranportal', '21232f297a57a5a743894a0e4a801fc3', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`a_id`);

--
-- Indexes for table `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`post_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `article`
--
ALTER TABLE `article`
  MODIFY `a_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `post`
--
ALTER TABLE `post`
  MODIFY `post_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
